Pandas란? </br>
- 구조화된 데이터 처리를 지원해 주는 라이브러리
- 스프레드시트 처리 기능 제공
- Pandas는 numpy를 사용한다

In [1]:
import pandas as pd

In [2]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-red.csv' #Data URL을 입력

위의 data_url로 데이터를 읽으면 ';'를 구분으로 데이터 파일이 형성된 것을 알 수 있다.

In [3]:
data_frame = pd.read_csv(data_url) 

data_frame.head(2)

  fixed acidity;"volatile acidity";"citric acid";"residual sugar";"chlorides";"free sulfur dioxide";"total sulfur dioxide";"density";"pH";"sulphates";"alcohol";"quality"
0   7.4;0.7;0;1.9;0.076;11;34;0.9978;3.51;0.56;9.4;5
1   7.8;0.88;0;2.6;0.098;25;67;0.9968;3.2;0.68;9.8;5

sep = ';'를 조건으로 분리하여 데이터를 읽어 오자!

참고로 위의 파일은 header가 설정된 파일이어서 만약 header가 없다면 header = None으로 설정

In [4]:
data_frame = pd.read_csv(data_url, sep=';') 
#csv 타입 데이터 로드, ';'로 separate하겠다.
# 만약 ';'이 아닌 tab으로 되어 있다면 sep = '\t'혹은 delimiter = '\t'로 처리


data_frame.head(2)#숫자 설정가능, default는 5

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.0,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.0,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5

In [5]:
data_frame.head(2)#숫자 설정가능, default는 5

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.0,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.0,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5

각각의 column은 Series로 이루어져 있다. 그리고 DataFrame은 이러한 Series들의 모음<br>
![Pandas_ch1_1](images/Pandas_ch1_1.png)

In [6]:
data_frame.tail()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [7]:
type(data_frame.chlorides)

pandas.core.series.Series

Series를 만들고 해당 Series를 사용하여 DataFrame을 만들자

In [8]:
list1 = [1,2,3,4]
list2 = ['one', 'two', 'three', 'four']

s1 = pd.core.series.Series(list1)
s2 = pd.core.series.Series(list2)

In [9]:
s1

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
s2

0      one
1      two
2    three
3     four
dtype: object

In [11]:
df = pd.DataFrame(data=dict(num=s1, word=s2))
df

   num   word
0    1    one
1    2    two
2    3  three
3    4   four

Series에서 index값 변경하고 Series 이름 설정

In [12]:
list_value = [1,2,3,4]
list_name = ['one', 'two', 'three', 'four']

s1 = pd.core.series.Series(data= list_value, index = list_name, name = 'word')
s1

one      1
two      2
three    3
four     4
Name: word, dtype: int64

Series에서의 값들에 접근하기

In [13]:
s1['three']

3

Series에 추가적으로 값넣기

In [14]:
s1['five'] = 5
s1

one      1
two      2
three    3
four     4
five     5
Name: word, dtype: int64

In [15]:
s1.values

array([1, 2, 3, 4, 5], dtype=int64)

In [16]:
s1.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [17]:
s1.name = 's1'
s1.index.name = 's1_data'
s1

s1_data
one      1
two      2
three    3
four     4
five     5
Name: s1, dtype: int64

DataFrame생성하기<br>
DataFrame : Series를 모아 만든 Data Table

In [18]:
friend_dict_list = [{'name' : 'beom', 'age' : 28, 'job' : 'student'},
                   {'name' : 'seek', 'age' : 28, 'job' : 'programmer'}]

In [19]:
df = pd.DataFrame(friend_dict_list)

In [20]:
df.head()

   age         job  name
0   28     student  beom
1   28  programmer  seek

dict과 같은 경우 key의 순서가 보장되지 않는다.

따라서 다시 column순서를 조정할 수 있다.

In [21]:
df = df[['name', 'age', 'job']]
df.head()

   name  age         job
0  beom   28     student
1  seek   28  programmer

아니면 생성시에 다음과 같이 columns를 명시해 줄 수 있다.<br>

In [22]:
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df.head()

   name  age         job
0  beom   28     student
1  seek   28  programmer

list를 만들 때 한꺼번에 만드는 것 또한 하나의 방법이다.

In [23]:
friends = [
        ['name', ['beom', 'seek']],
        ['age', [28,28]],
        ['job', ['student', 'programmer']]
]

In [24]:
df = pd.DataFrame.from_items(friends)
df.head()

   name  age         job
0  beom   28     student
1  seek   28  programmer

혹은 다음과 같이 collections의 OrderedDict를 사용할 수 있다.

In [25]:
from collections import OrderedDict

In [26]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['beom', 'seek']),
        ('age', [28,28]),
        ('job', ['student', 'programmer'])
    ]
)

In [27]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age         job
0  beom   28     student
1  seek   28  programmer

In [28]:
df.name

0    beom
1    seek
Name: name, dtype: object

In [29]:
df['name']

0    beom
1    seek
Name: name, dtype: object

loc(index location)<br>
iloc(index position)<br>
loc과 iloc 활용하기<br>

loc은 DataFrame에서의 해당 index의 데이터를 가져옴
iloc은 Series에서의 해당 index의 데이터를 가져옴

In [30]:
df.loc[1]

name          seek
age             28
job     programmer
Name: 1, dtype: object

In [31]:
df['job'].iloc[0]

'student'

Column에 새로운 데이터 할당하기

In [32]:
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job', 'debt'])

In [33]:
df.debt = df.age > 25
df

   name  age         job  debt
0  beom   28     student  True
1  seek   28  programmer  True

DataFrame column삭제하기

In [34]:
del df['job']
df

   name  age  debt
0  beom   28  True
1  seek   28  True